<template>
  <div class="body-content">
    <!--卡片分割-->
    <el-card class="box-card">
      <div slot="header" class="clearfix">
        <span>2019年上半年上午试题</span>
      </div>
      <div v-for="o in 100" :key="o" class="text item">
        <div class="questions">
          <p>
            ●直接存储器访问(DMA)是一种快速传送大量数据常用的技术。工作过程大致如下所述。
          </p>
          <p>
            1.向CPU申请DMA传送。
          </p>
          <p>
            2.向CPU申请DMA控制器接管<strong> ( 1 ) </strong>的控制权。
          </p>
          <p>
            3.在DMA控制器的控制下，在存储器和<strong> ( 2 ) </strong>之间直接进行数据传送，在传送过中不需要<strong> ( 3 ) </strong>的参与。开始时需提供要传送的数据的<strong> ( 4 ) </strong>和<strong> ( 5 ) </strong>。
          </p>
          <p>
            4.传送结束后，向CPU返回DMA操作完成信号。
          </p>
        </div>
        <div class="answers">
          <p>
            【说明】
            某学校欲开发一学生跟踪系统，以便更自动化、更全面地对学生在校情况（到课情况和健康状态等）
            进行管理和追踪，使家长能及时了解子女的到课情况和健康状态，并在有 健康问题时及时与医护机构对接。
            该系统的主要功能是：
            （1）采集学生状态。通过学生卡传感器，采集学生心率、体温（摄氏度）等健康指
            标及其所在位置等信息并记录。每张学生卡有唯一的标识（ID）与一个学生对应。
            （2）健康状态告警。在学生健康状态出问题时，系统向班主任、家长和医护机构健
            康服务系统发出健康状态警告，由医护机构健康服务系统通知相关医生进行处理。
            （3）到课检查。综合比对学生状态、课表以及所处校园场所之间的信息对学生到课
            情况进行判定。对旷课学生，向其家长和班主任发送旷课警告。
            （4）汇总在校情况。定期汇总在校情况，并将报告发送给家长和班主任。
            （5）家长注册。家长注册使用该系统，指定自己子女，存入家长信息，待审核。
            （6）基础信息管理。学校管理人员对学生及其所用学生卡和班主任、课表（班级、
            上课时间及场所等）、校园场所（名称和所在位置区域）等基础信息进行管理；对家长注册申请进行审核，
            更新家长状态，将家长ID加入学生信息记录中使家长与其子女进行关 联，向家长发送注册结果。
            一个学生至少有一个家长，可以有多个家长。课表信息包括班 级、班主任、时间和位置等。
            现采用结构化方法对学生跟踪系统进行分析与设计，获得如图1-1所示的上下文数据流图和图1-2所示的0层数据流图。

            【问题1】（5分）
            使用说明中的词语，给出图1-1中的实体E1〜E5的名称。
            <p>
              E1:学生
            </p>
            <p>
              E2:学校管理人员
            </p>
            <p>
              E3:医护机构
            </p>
            <p>
              E4:家长
            </p>
            <p>
              E5:班主任
            </p>
            【问题2】（4分）
            使用说明中的词语，给出图1-2中的数据存储D1〜D4的名称。
            <p>
              D1:学生状态信息表
            </p>
            <p>
              D2:学生信息表
            </p>
            <p>
              D3:校园场所记录表
            </p>
            <p>
              D4:到课检查表
            </p>
            【问题3】（3分）
            根据说明和图中术语，补充图1-2中缺失的数据流及其起点和终点（三条即可）。
            【问题4】（3分）
            根据说明中的术语，说明图1-1中数据流“学生状态”和“学生信息”的组成。
            <p>
              学生状态包括：学生卡ID 学生心率 学生体温等健康指标及其所在位置信息
            </p>
            <p>
              学生信息包括：学生卡ID 家长ID 学生ID 班主任信息
            </p>

          <p>
            【说明】
            某创业孵化基地管理若干孵化公司和创业公司，为规范管理创业项目投资业务，需要
            开发一个信息系统。请根据下述需求描述完成该系统的数据库设计。
          </p>
          <p>
            【需求描述】
            （1）记录孵化公司和创业公司的信息。孵化公司信息包括公司代码、公司名称、法
            人代表名称、注册地址和一个电话；创业公司信息包括公司代码、公司名称和一个电话。
            孵化公司和创业公司的公司代码编码不同。
            （2）统一管理孵化公司和创业公司的员工。员工信息包括工号、身份证号、姓名、 性别、所属公司代码和一个手机号，
            工号唯一标识每位员工。
            （3）记录投资方信息。投资方信息包括投资方编号、投资方名称和一个电话。
            （4）投资方和创业公司之间依靠孵化公司牵线建立创业项目合作关系，具体实施由
            孵化公司的一位员工负责协调投资方和创业公司的一个创业项目。一个创业项目只属于一个创业公司，
            但可以接受若干投资方的投资。创业项目信息包括项目编号、创业公司代码、 投资方编号和孵化公司员工工号。
            【概念模型设计】
            根据需求阶段收集的信息，设计的实体联系图（不完整）如图2-1所示。

          </p>
          <p>
            【逻辑结构设计】
            根据概念模型设计阶段完成的实体联系图，得出如下关系模式（不完整）:
            孵化公司（公司代码，公司名称，法人代表名称，注册地址，电话）
            创业公司（公司代码，公司名称，电话）
            员工（工号，身份证号，姓名，性别， （a）,手机号）
            投资方（投资方编号、投资方名称，电话）
            项目（项目编号，创业公司代码（b），孵化公司员工号）
          </p>
          <p>
            【问题1】（5分）
            根据问题描述，补充图2-1的实体联系图。
            【问题2】（4分）
            补充逻辑结构设计结果中的（a）、（b）两处空缺及完整性约束关系。
            【问题3】（6分）
            若创业项目的信息还需要包括投资额和投资时间，那么：
            （1）是否需要增加新的实体来存储投资额和投资时间？
            （2）如果增加新的实体，请给出新实体的关系模式，并对图2-1进行补充。
            如果不需要增加新的实体，请将“投资额”和“投资时间”两个属性补充连线到图2-1合适的对象上，并对变化的关系模式进行修改。
          </p>
        </div>
      </div>
    </el-card>
  </div>
</template>

<script>
export default {
  name: 'Afternoon',
  data () {
    return {
      answers: {}
    }
  }
}
</script>

<style scoped>
.body-content {
  margin: 10px 20px;
  font-size: 20px;
}
strong {
  color: red;
}
</style>
